Revit 2026 API

# IPrintSetting Interface

---

An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IPrintSetting
```
```vb
Public Interface IPrintSetting
```
```cpp
public interface class IPrintSetting
```
```fsharp
type IPrintSetting = interface end
```

The IPrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrintParameters | Returns the Parameters of Print Setup. |

#### Reference

Autodesk.Revit.DB Namespace